Repository: authoress/sphinx-intl-guide
Catalog: locales/*/LC_MESSAGES/create-demo-project.po
Languages: ru

source: Create demo project
ru: Создание демонстрационного проекта

source: Our demo project will contain information `about The Zen of Python <https://www.python.org/dev/peps/pep-0020/>`_.
ru: Наш демонстрационный проект будет содержать информацию о `The Zen of Python <https://www.python.org/dev/peps/pep-0020/>`_.

source: To create a demo project:
ru: Чтобы создать демонстрационный проект:

source: Create a directory for the demo project::
ru: Создайте каталог для демонстрационного проекта::

source: Go to the demo directory::
ru: Перейдите в папку проекта::

source: Create a new sphinx project with sphinx-quickstart::
ru: Создайте новый проект sphinx с помощью sphinx-quickstart::

source: This command runs the Sphinx quickstart utility that asks you some questions about your project settings. Specify the settings as follows:
ru: Эта команда запускает утилиту Sphinx quickstart, которая задает вам несколько вопросов о настройках вашего проекта. Укажите следующие параметры:

source: You can specify your own settings, but be sure to set the project language to English (en).
ru: Вы можете указать свои настройки, но обязательно установите язык проекта на английский (en).

source: After you answer all questions, the quickstart utility creates the project::
ru: После того, как вы ответите на все вопросы, утилита Sphinx quickstart создаст проект::

source: If you are familiar with Sphinx, you already know about index.rst, conf.py and other default project files.
ru: Если вы знакомы со Sphinx, вы уже знаете о index.rst, conf.py и других файлах проекта по умолчанию.

source: Add content
ru: Добавление содержимого

source: Open index.rst in any text editor and replace its content with the following:
ru: Откройте index.rst в любом текстовом редакторе и замените его содержимое следующим:

source: We added easter-egg.rst to the toctree, which means that we should create this file in the project directory. After you created the file (it should be encoded in UTF-8), put this text in it:
ru: Мы добавили easter-egg.rst в toctree, а это значит, что мы должны создать этот файл в папке проекта. После того, как вы создали файл (он должен быть кодирован в UTF-8), поместите в него этот текст:

source: You can download `an archive that contains both files <../_static/rst-initial.zip>`_.
ru: Вы можете скачать `архив, содержащий оба файла <../_static/rst-initial.zip>`_.

source: Add images
ru: Добавление изображений

source: To add images to the demo project:
ru: Чтобы добавить изображения в демонстрационный проект:

source: Download `an archive containing two images <../_static/egg-logo.zip>`_: logo.png (demo project logo) and egg.png (image of an egg).
ru: Загрузите `архив, содержащий два изображения <../_static/egg-logo.zip>`_: logo.png (логотип демонстрационного проекта) и egg.png (изображение яйца).

source: Unzip the archive and place both files in the **_static** directory of the demo project.
ru: Разархивируйте архив и поместите оба файла в каталог **_static** демонстрационного проекта.

source: Open conf.py, find the **Options for HTML output** section. Add html_theme_options containing logo.png after html_theme, like this:
ru: Откройте conf.py, найдите раздел **Options for HTML output**. Добавьте html_theme_options, содержащий logo.png, после html_theme, вот так:

source: Add egg.png to easter-egg.rst, like this:
ru: Добавьте egg.png в easter-egg.rst, вот так:

source: Note that if you specified your own settings when creating the project, they will be overwritten by the settings from the downloaded conf.py.
ru: Обратите внимание, что если вы указали собственные настройки при создании проекта, они будут перезаписаны настройками из загруженного conf.py.

source: Generate html
ru: Генерация html

source: Generate an html output to make sure everything works as expected::
ru: Сгенерируйте html, чтобы убедиться, что все работает как положено:

source: If the build is successful, the **_build/html** directory contains the html output::
ru: Если сборка выполнена успешно, каталог **_build/html** содержит html-файлы::

source: If you open index.html in a browser, you should see the demo project:
ru: Если вы откроете index.html в браузере, вы должны увидеть демонстрационный проект:
