Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/add-and-translate-new-content.po
Languages: fr, ru

source: Add and translate new content
fr: Ajouter et traduire du nouveau contenu
ru: Добавление и перевод нового контента

source: Add conditional content with ifconfig
fr: Ajouter du contenu conditionnel avec ifconfig
ru: Добавление условного контента с помощью ifconfig

source: *Conditional content* is published to the output only if it matches the specified conditions. In our project, this condition is the language of the document.
fr: *Le contenu conditionnel* n'est publié que s'il répond aux conditions spécifiées. Dans notre projet, cette condition est la langue du document.
ru: *Условный контент* публикуется, только если он соответствует заданным условиям. В нашем проекте этим условием является язык документа.

source: For Sphinx to process the conditional text, it needs the `ifconfig <https://www.sphinx-doc.org/en/master/usage/extensions/ifconfig.html>`_ extension. Add ifconfig to the extensions list in conf.py:
fr: Pour que Sphinx puisse traiter le texte conditionnel, il a besoin de l'extension `ifconfig <https://www.sphinx-doc.org/en/master/usage/extensions/ifconfig.html>`_. Ajoutez ifconfig à la liste des extensions dans conf.py :
ru: Чтобы Sphinx мог обрабатывать условный текст, ему необходимо расширение `ifconfig <https://www.sphinx-doc.org/en/master/usage/extensions/ifconfig.html>`_. Добавьте ifconfig в список расширений в conf.py:

source: Now we will add some information about translation of the text to index.rst. This information is not needed in the original document, so we will exclude this text from English.
fr: Nous allons maintenant ajouter à index.rst des informations sur la traduction du texte. Cette information n'est pas nécessaire dans le document original, nous allons donc exclure ce texte de l'anglais.
ru: Теперь мы добавим информацию о переводе текста в index.rst. Эта информация не нужна в оригинальном документе, поэтому мы исключим этот текст из английского языка.

source: Open index.rst and add "Translation info" to the end of the file, like this:
fr: Ouvrez index.rst et ajoutez "Translation info" à la fin du fichier, comme ceci :
ru: Откройте index.rst и добавьте "Translation info" в конец файла, вот так:

source: Note that we added the text to the source .rst file in English, not to .po files. You will see later that this text won't be published in the html output in English.
fr: Notez que nous avons ajouté le texte au fichier source .rst en anglais, et non aux fichiers .po. Vous verrez plus tard que ce texte ne sera pas publié dans la sortie html en anglais.
ru: Обратите внимание, что мы добавили текст в исходный файл .rst на английском языке, а не в файлы .po. Позже вы увидите, что этот текст не будет опубликован в документации на английском языке.

source: You can `download the updated version of conf.py and index.rst <_static/conf-index-ifconfig.zip>`_.
fr: Vous pouvez `télécharger la version mise à jour de conf.py et index.rst <_static/conf-index-ifconfig.zip>`_.
ru: Вы можете `загрузить обновленную версию conf.py и index.rst <_static/conf-index-ifconfig.zip>`_.

source: Update translation
fr: Mise à jour de la traduction
ru: Обновление перевода

source: You already know how to deal with .pot and .po files:
fr: Vous savez déjà comment traiter les fichiers .pot et .po :
ru: Вы уже знаете, как обращаться с файлами .pot и .po:

source: Generate .pot files::
fr: Générer des fichiers .pot: :
ru: Сгенерируйте файлы .pot::

source: This command updates index.pot in **_build/gettext**.
fr: Cette commande met à jour index.pot dans **_build/gettext**.
ru: Эта команда обновляет index.pot в **_build/gettext**.

source: Generate .po files::
fr: Générer des fichiers .po: :
ru: Сгенерируйте файлы .po::

source: This command updates index.po in **locale/ru/LC_MESSAGES** and **locale/pt_BR/LC_MESSAGES**.
fr: Cette commande met à jour index.po dans **locale/ru/LC_MESSAGES** et **locale/pt_BR/LC_MESSAGES**.
ru: Эта команда обновляет index.po в **locale/ru/LC_MESSAGES** и **locale/pt_BR/LC_MESSAGES**.

source: Translate the new strings in both index.po files.
fr: Traduire les nouvelles chaînes dans les deux fichiers index.po.
ru: Переведите новые строки в обоих файлах index.po.

source: Russian:
fr: Russe :
ru: Русский:

source: Portuguese:
fr: Le portugais :
ru: Португальский:

source: You can `download both updated index.po files <_static/index-po-updated.zip>`_.
fr: Vous pouvez `télécharger les deux fichiers index.po mis à jour <_static/index-po-updated.zip>`_.
ru: Вы можете `загрузить оба обновленных файла index.po <_static/index-po-updated.zip>`_.

source: Build updated documentation
fr: Création d'une documentation mise à jour
ru: Сборка обновленной документации

source: Build the Russian documentation::
fr: Construire la documentation russe: :
ru: Сборка документации на русском::

source: Build the Portuguese documentation::
fr: Construire la documentation portugaise: :
ru: Сборка документации на португальском::

source: Now index.html in Portuguese and Russian should contain the newly added information about translation. If you build English documentation, you will see that no new content is added to index.html.
fr: L'index.html en portugais et en russe devrait maintenant contenir les informations nouvellement ajoutées sur la traduction. Si vous construisez la documentation en anglais, vous verrez qu'aucun nouveau contenu n'est ajouté à l'index.html.
ru: Теперь index.html на португальском и русском языках должен содержать вновь добавленную информацию о переводе. Если вы запустите сборку документации на английском языке, вы увидите, что в index.html не добавляется новый контент.
