Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/add-language-switcher.po
Languages: fr, ru

source: Add language switcher
fr: Ajouter un sélecteur de langue
ru: Добавление переключателя языка

source: Let's create a simple language switcher and add it to the sidebar. We will also add a start page that contains links to our documentation in different languages.
fr: Créons un simple sélecteur de langue et ajoutons-le à la barre latérale. Nous ajouterons également une page d'accueil contenant des liens vers notre documentation dans différentes langues.
ru: Давайте создадим простой переключатель языков и добавим его на боковую панель. Мы также добавим стартовую страницу, содержащую ссылки на нашу документацию на разных языках.

source: Sidebar language switcher
fr: Sélecteur de langue dans la barre latérale
ru: Добавление переключателя языка

source: The language switcher should contain all three languages: English, Russian, and Portuguese. The current language of the page should be displayed as text, and the other two languages should be linked to the same page in those languages.
fr: Le sélecteur de langue doit contenir les trois langues : anglais, russe et portugais. La langue actuelle de la page doit être affichée sous forme de texte, et les deux autres langues doivent être liées à la même page dans ces langues.
ru: Переключатель языка должен содержать все три языка: английский, русский и португальский. Текущий язык страницы должен отображаться в виде текста, а два других языка должны быть связаны с той же страницей на этих языках.

source: For example, the language switcher on easter-egg.html in English should look like this:
fr: Par exemple, le sélecteur de langue sur le site easter-egg.html en anglais devrait ressembler à ceci :
ru: Например, переключатель языка на easter-egg.html на английском языке должен выглядеть так:

source: Just text. The triangle indicates the current language.
fr: Uniquement du texte. Le triangle indique la langue actuelle.
ru: Просто текст. Треугольник указывает текущий язык.

source: Link to easter-egg.html in Russian.
fr: Lien vers easter-egg.html en russe.
ru: Ссылка на easter-egg.html на русском языке.

source: Link to easter-egg.html in Portuguese.
fr: Lien vers easter-egg.html en portugais.
ru: Ссылка на easter-egg.html на португальском языке.

source: For the language switcher, we will use `Jinja templates <https://www.sphinx-doc.org/en/master/templating.html>`_. Two predefined Jinja variables are used in our template: **pagename** and **language**.
fr: Pour le sélecteur de langue, nous utiliserons des modèles `Jinja <https://www.sphinx-doc.org/en/master/templating.html>`_. Deux variables Jinja prédéfinies sont utilisées dans notre modèle : **nom de la page** et **langue**.
ru: Для переключателя языка мы будем использовать шаблоны `Jinja <https://www.sphinx-doc.org/en/master/templating.html>`_. В нашем шаблоне используются две предопределенные переменные Jinja: **pagename** и **language**.

source: Add language switcher to our project:
fr: Ajouter un sélecteur de langue à notre projet :
ru: Добавьте переключатель языка в наш проект:

source: Create a UTF-8 encoded file, name it switcher.html and put this code in it:
fr: Créez un fichier encodé en UTF-8, nommez-le switcher.html et mettez-y ce code :
ru: Создайте файл в кодировке UTF-8, назовите его switcher.html и поместите в него этот код:

source: Alternatively, you can `download switcher.html <../_static/switcher.zip>`_.
fr: Alternativement, vous pouvez `télécharger switcher.html <_static/switcher.zip>`_.
ru: Кроме того, вы можете `загрузить switcher.html <_static/switcher.zip>`_.

source: Place switcher.html in the **_templates** directory; by default Sphinx looks for Jinja templates in this directory.
fr: Placez switcher.html dans le répertoire **_templates** ; par défaut, Sphinx recherche les modèles Jinja dans ce répertoire.
ru: Поместите switcher.html в папку **_templates**; по умолчанию Sphinx ищет шаблоны Jinja в этой папке.

source: According to the `Alabaster template documentation <https://alabaster.readthedocs.io/en/latest/installation.html>`_, add an explicit html_sidebars setting to conf.py:
fr: Selon la documentation du modèle `Alabaster <https://alabaster.readthedocs.io/en/latest/installation.html>`_, ajoutez un paramètre explicite html_sidebars à conf.py :
ru: В соответствии с документацией `Alabaster <http://alabaster.geekwriter.ru/installation.html>`_ добавьте явный параметр html_sidebars в conf.py:

source: I added switcher.html to the default Alabaster sidebar and removed the elements that we do not need (donate.html, relations.html etc). As usual, you can `download the updated conf.py <../_static/conf-switcher.zip>`_.
fr: J'ai ajouté switcher.html à la sidebar par défaut d'Alabaster et supprimé les éléments dont nous n'avons pas besoin (donate.html, relations.html etc). Comme d'habitude, vous pouvez `télécharger le conf.py mis à jour <_static/conf-switcher.zip>`_.
ru: Я добавила switcher.html на боковую панель Alabaster по умолчанию и удалила элементы, которые нам не нужны (donate.html, relations.html и т. д.). Как обычно, вы можете `скачать обновленный файл conf.py <_static/conf-switcher.zip>`_.

source: Sphinx will now use switcher.html to add the language switcher to the sidebar of each documentation page.
fr: Sphinx utilisera désormais switcher.html pour ajouter le sélecteur de langue à la barre latérale de chaque page de documentation.
ru: Теперь Sphinx будет использовать switcher.html для добавления переключателя языка на боковую панель каждой страницы документации.

source: After you rebuild the documentation, you can see the newly added language switcher:
fr: Après avoir reconstruit la documentation, vous pouvez voir le nouveau sélecteur de langue :
ru: После того, как вы пересоберете документацию, вы увидите только что добавленный переключатель языка:

source: Language switcher on the index.html page
fr: Sélecteur de langue sur la page index.html
ru: Переключатель языка на странице index.html

source: For our language switcher to work, the documentation for each language must be placed in a directory named after the language code, and these directories must be at the same nesting level, for example:
fr: Pour que notre sélecteur de langue fonctionne, la documentation de chaque langue doit être placée dans un répertoire nommé d'après le code de la langue, et ces répertoires doivent être au même niveau d'imbrication, par exemple :
ru: Чтобы наш переключатель языков работал, документация для каждого языка должна быть помещена в папку, названную в соответствии с кодом языка, и эти папки должны быть на одном уровне вложенности, например:

source: <doc_directory>/**en**/<English_documentation_files>
fr: <doc_directory>/**fr**/<Fichiers_documentation_anglais>
ru: <папка_документации>/**en**/<файлы_документации_на_английском>

source: <doc_directory>/**ru**/<Russian_documentation_files>
fr: <doc_directory>/**ru**/<fichiers_documentation_russe>
ru: <папка_документации>/**ru**/<файлы_документации_на_русском>

source: <doc_directory>/**pt_BR**/<Portuguese_documentation_files>
ru: <папка_документации>/**pt_BR**/<файлы_документации_на_португальском>

source: We already :ref:`built our documentation this way <build>`.
fr: Nous avons déjà :ref:`construit notre documentation de cette façon <build>`.
ru: Мы уже :ref:`собрали нашу документацию таким образом <build>`.

source: If you use a similar language switcher in your project, make sure to keep the directories structure when you upload your documentation online.
fr: Si vous utilisez un sélecteur de langue similaire dans votre projet, veillez à conserver la structure des répertoires lorsque vous téléchargez votre documentation en ligne.
ru: Если вы используете аналогичный переключатель языка в своем проекте, обязательно сохраните структуру папок при выгрузке документации в Интернет.

source: Start page
fr: Page d'accueil
ru: Стартовая страница

source: Our start page is a simple HTML file that contains several links and images.
fr: Notre page d'accueil est un simple fichier HTML qui contient plusieurs liens et images.
ru: Наша стартовая страница представляет собой простой HTML-файл, содержащий несколько ссылок и изображений.

source: Start page contents
fr: Contenu de la page d'accueil
ru: Содержимое стартовой страницы

source: The start page file named index.html contains the following code::
fr: Le fichier de la page d'accueil nommé index.html contient le code suivant: :
ru: Файл стартовой страницы с именем index.html содержит следующий код::

source: There are four images used on the start page:
fr: Quatre images sont utilisées sur la page d'accueil :
ru: На стартовой странице используются четыре изображения:

source: logo_index.png for our project logo.
fr: logo_index.png pour le logo de notre projet.
ru: logo_index.png для логотипа нашего проекта.

source: en.png for the British flag.
fr: en.png pour le drapeau britannique.
ru: en.png для британского флага.

source: ru.png for the Russian flag.
fr: ru.png pour le drapeau russe.
ru: ru.png для российского флага.

source: pt_BR.png for the Brazilian flag.
fr: pt_BR.png pour le drapeau brésilien.
ru: pt_BR.png для бразильского флага.

source: The images should be placed in the **img** directory at the same level as the index.html file. You can download `index.html and the img directory <../_static/start-page.zip>`_, and then place them into the **_build/html** directory of our documentation, like this::
fr: Les images doivent être placées dans le répertoire **img** au même niveau que le fichier index.html. Vous pouvez télécharger `index.html et le répertoire img <../_static/start-page.zip>`_, puis les placer dans le répertoire **_build/html** de notre documentation, comme ceci: :
ru: Изображения должны быть размещены в каталоге **img** на том же уровне, что и index.html файл. Вы можете скачать `index.html и каталог img <../_static/start-page.zip>`_, а затем поместите их в каталог **_build/html** нашей документации, вот так::

source: You do not need to rebuild the documentation after adding the start page.
fr: Il n'est pas nécessaire de reconstruire la documentation après avoir ajouté la page de démarrage.
ru: Вам не нужно пересобирать документацию после добавления стартовой страницы.
