Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/appendices.po
Languages: fr, ru

source: Appendices
fr: Annexes
ru: Приложения

source: A little about gettext
fr: Quelques mots sur gettext
ru: Немного о gettext

source: If you are not a developer but rather a documentation or localization specialist (like I am), you probably do not need to know about gettext in detail. It is enough to know some general facts:
fr: Si vous n'êtes pas un développeur mais plutôt un spécialiste de la documentation ou de la localisation (comme moi), vous n'avez probablement pas besoin de connaître gettext en détail. Il suffit de connaître quelques généralités :
ru: Если вы не разработчик, а специалист по документации или локализации (как и я), вам, вероятно, не нужно подробно знать о gettext. Достаточно знать некоторые общие факты:

source: Gettext uses a message-as-key approach: there are no string resource identifiers in the source code, gettext uses the natural language strings inside the source code as keys for looking up translations. If no translation is available, gettext returns the original string.
fr: Gettext utilise une approche de message en tant que clé : il n'y a pas d'identificateurs de ressources de chaînes dans le code source, gettext utilise les chaînes en langage naturel dans le code source comme clés pour rechercher des traductions. Si aucune traduction n'est disponible, gettext renvoie la chaîne originale.
ru: Gettext использует подход "message-as-key": в исходном коде нет идентификаторов строковых ресурсов, gettext использует строки на естественном языке внутри исходного кода в качестве ключей для поиска переводов. Если перевод недоступен, gettext возвращает исходную строку.

source: *In my experience with Sphinx, the source language does not have to be English. I translated documentation from Russian to English, and everything worked perfectly.*
fr: *Dans mon expérience avec Sphinx, la langue source n'a pas besoin d'être l'anglais. J'ai traduit une documentation du russe vers l'anglais et tout a fonctionné parfaitement.*
ru: *По моему опыту работы со Sphinx, исходный язык не обязательно должен быть английским. Я переводила документацию с русского на английский, и все отлично получилось.*

source: Gettext is not specific for Python, as it is used in C, C++ development etc. Every time you work with .po files it almost certainly means that gettext is behind the scenes.
fr: Gettext n'est pas spécifique à Python, car il est utilisé dans le développement C, C++, etc. Chaque fois que vous travaillez avec des fichiers .po, cela signifie presque certainement que gettext se trouve dans les coulisses.
ru: Gettext не является специфичным для Python, так как он используется в разработке C, C++ и т. д. Каждый раз, когда вы работаете с файлами .po, это почти наверняка означает, что где-то за кулисами находится gettext.

source: Gettext supports plural forms. We do not cover this feature in our guide, but it's nice to know about the possibility.
fr: Gettext prend en charge les formes plurielles. Nous ne couvrons pas cette fonctionnalité dans notre guide, mais il est bon d'en connaître la possibilité.
ru: Gettext поддерживает формы множественного числа. Мы не рассматриваем эту функцию в нашем руководстве, но приятно знать о такой возможности.

source: Useful links
fr: Liens utiles
ru: Полезные ссылки

source: Sphinx documentation:
fr: Documentation Sphinx :
ru: Документация Sphinx:

source: Internationalization with sphinx-intl: `https://www.sphinx-doc.org/en/master/usage/advanced/intl.html <https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_
fr: Internationalisation avec sphinx-intl : `https://www.sphinx-doc.org/en/master/usage/advanced/intl.html <https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_

source: Options for internationalization: `https://www.sphinx-doc.org/en/master/usage/configuration.html#options-for-internationalization <https://www.sphinx-doc.org/en/master/usage/configuration.html#options-for-internationalization>`_
fr: Options d'internationalisation : `https://www.sphinx-doc.org/en/master/usage/configuration.html#options-for-internationalization <https://www.sphinx-doc.org/en/master/usage/configuration.html#options-for-internationalization>`_

source: Filename format for language-specific figures: `https://www.sphinx-doc.org/en/master/usage/configuration.html#confval-figure_language_filename <https://www.sphinx-doc.org/en/master/usage/configuration.html#confval-figure_language_filename>`_
fr: Format de fichier pour les figures spécifiques à une langue : `https://www.sphinx-doc.org/en/master/usage/configuration.html#confval-figure_language_filename <https://www.sphinx-doc.org/en/master/usage/configuration.html#confval-figure_language_filename>`_

source: Jinja templates in Sphinx: `https://www.sphinx-doc.org/en/master/templating.html <https://www.sphinx-doc.org/en/master/templating.html>`_
fr: Modèles Jinja dans Sphinx : `https://www.sphinx-doc.org/en/master/templating.html <https://www.sphinx-doc.org/en/master/templating.html>`_

source: Readthedocs documentation:
fr: Documentation Readthedocs :
ru: Документация Readthedocs:

source: Getting Started with Sphinx: `https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html <https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html>`_
fr: S'initier à Sphinx : `https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html <https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html>`_

source: Manage Translations for Sphinx projects: `https://docs.readthedocs.io/en/stable/guides/manage-translations-sphinx.html <https://docs.readthedocs.io/en/stable/guides/manage-translations-sphinx.html>`_
fr: Gestion des traductions pour les projets Sphinx : `https://docs.readthedocs.io/en/stable/guides/manage-translations-sphinx.html <https://docs.readthedocs.io/en/stable/guides/manage-translations-sphinx.html>`_

source: Transifex documentation:
fr: Documentation Transifex :

source: Transifex organizations, projects and resources: `https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources <https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources>`_
fr: Organisations, projets et ressources Transifex : `https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources <https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources>`_

source: GitHub integration: `https://help.transifex.com/en/articles/6265125-github-via-transifex-ui <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_
fr: Intégration GitHub : `https://help.transifex.com/en/articles/6265125-github-via-transifex-ui <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_

source: GitHub Pages documentation:
fr: Documentation des GitHub Pages :

source: Other:
fr: Autre :
ru: Документация на Geekwriter:

source: Miniconda commands: `http://miniconda.geekwriter.ru/en/conda-commands.html <http://miniconda.geekwriter.ru/en/conda-commands.html>`_
fr: Commandes Miniconda : `http://miniconda.geekwriter.ru/en/conda-commands.html <http://miniconda.geekwriter.ru/en/conda-commands.html>`_
ru: Команды Miniconda: `http://miniconda.geekwriter.ru/conda-commands.html <http://miniconda.geekwriter.ru/conda-commands.html>`_

source: Alabaster template sidebar: `https://alabaster.readthedocs.io/en/latest/installation.html <https://alabaster.readthedocs.io/en/latest/installation.html>`_
fr: Barre latérale du modèle Alabaster : `https://alabaster.readthedocs.io/en/latest/installation.html <https://alabaster.readthedocs.io/en/latest/installation.html>`_
ru: Боковая панель шаблона Alabaster: `http://alabaster.geekwriter.ru/installation.html <http://alabaster.geekwriter.ru/installation.html>`_

source: Demo project files
fr: Fichiers de projets de démonstration
ru: Файлы демонстрационного проекта

source: Here you can find all the archives that are offered for download in the sections of this guide:
fr: Vous trouverez ici toutes les archives proposées au téléchargement dans les sections de ce guide :
ru: Здесь вы можете найти все архивы, которые предлагаются для скачивания в разделах данного руководства:

source: Create virtual environment: `requirements.txt <_static/requirements.zip>`_
fr: Créer un environnement virtuel : `requirements.txt <_static/requirements.zip>`_.

source: Add images: `logo.png and egg.png <_static/egg-logo.zip>`_; `conf.py and easter-egg.rst <_static/conf-easter-egg.zip>`_
fr: Ajouter des images : `logo.png et egg.png <_static/egg-logo.zip>`_ ; `conf.py et easter-egg.rst <_static/conf-easter-egg.zip>`_

source: Install and configure sphinx-intl: `conf.py <_static/conf-loc-options.zip>`_
fr: Installer et configurer sphinx-intl : `conf.py <_static/conf-loc-options.zip>`_

source: Translate text in .po files: `translation lists <_static/translation-lists.zip>`_, `translated .po files <_static/po-translated.zip>`_
fr: Traduire du texte dans des fichiers .po : `listes de traduction <_static/translation-lists.zip>`_, `fichiers .po traduits <_static/po-translated.zip>`_

source: Add language-specific images: `egg.ru.png and egg.pt_BR.png <_static/egg-ru-pt_BR.zip>`_
fr: Ajout d'images spécifiques à la langue : `egg.ru.png et egg.pt_BR.png <_static/egg-ru-pt_BR.zip>`_.

source: Add conditional content with ifconfig: `conf.py and index.rst <_static/conf-index-ifconfig.zip>`_
fr: Ajouter du contenu conditionnel avec ifconfig : `conf.py et index.rst <_static/conf-index-ifconfig.zip>`_

source: Update translation: `updated index.po for Russian and Portuguese <_static/index-po-updated.zip>`_
fr: Mise à jour de la traduction : `updated index.po for Russian and Portuguese <_static/index-po-updated.zip>`_.

source: Add language switcher: `switcher.html <_static/switcher.zip>`_ and `conf.py <_static/conf-switcher.zip>`_, `start page files <_static/start-page.zip>`_ (index.html and images)
fr: Ajout d'un sélecteur de langue : `switcher.html <_static/switcher.zip>`_ et `conf.py <_static/conf-switcher.zip>`_, `fichiers de la page de démarrage <_static/start-page.zip>`_ (index.html et images)

source: You can also find the demo project `on Github <https://github.com/authoress/sphinx-intl-demo>`_.
fr: Vous pouvez également trouver le projet de démonstration `sur Github <https://github.com/authoress/sphinx-intl-demo>`_.

source: Create virtual environment: `requirements.txt <../_static/requirements.zip>`_
ru: Создание виртуальной среды: `requirements.txt <../_static/requirements.zip>`_

source: Add content: `index.rst and easter-egg.rst <../_static/rst-initial.zip>`_
ru: Добавление содержимого: `index.rst и easter-egg.rst <../_static/rst-initial.zip>`_

source: Add images: `logo.png and egg.png <../_static/egg-logo.zip>`_; `conf.py and easter-egg.rst <../_static/conf-easter-egg.zip>`_
ru: Добавление изображений: `logo.png и egg.png <../_static/egg-logo.zip>`_; `conf.py и easter-egg.rst <../_static/conf-easter-egg.zip>`_

source: Install and configure sphinx-intl: `conf.py <../_static/conf-loc-options.zip>`_
ru: Установка и настройка sphinx-intl: `conf.py <../_static/conf-loc-options.zip>`_

source: Translate text in .po files: `translation lists <../_static/translation-lists.zip>`_, `translated .po files <../_static/po-translated.zip>`_
ru: Перевод текста в файлах .po: `списки переводов <../_static/translation-lists.zip>`_, `переведенные файлы .po <../_static/po-translated.zip>`_

source: Add language-specific images: `egg.ru.png and egg.pt_br.png <../_static/egg-ru-pt_br.zip>`_
ru: Добавление изображений для разных языков: `egg.ru.png и egg.pt_br.png <../_static/egg-ru-pt_br.zip>`_

source: Add conditional content with ifconfig: `conf.py and index.rst <../_static/conf-index-ifconfig.zip>`_
ru: Добавление условного контента с помощью ifconfig: `conf.py и index.rst <../_static/conf-index-ifconfig.zip>`_

source: Update translation: `updated index.po for Russian and Portuguese <../_static/index-po-updated.zip>`_
ru: Обновление перевода: `обновленный index.po для русского и португальского языков <../_static/index-po-updated.zip>`_

source: Add language switcher: `switcher.html <../_static/switcher.zip>`_ and `conf.py <../_static/conf-switcher.zip>`_
ru: Добавление переключателя языка: `switcher.html <../_static/switcher.zip>`_ и `conf.py <../_static/conf-switcher.zip>`_

source: You can also find the demo project `on Github <https://github.com/authoress/sphinx-intl-demo>`_ or `download the project here <../_static/zen.zip>`_.
ru: Вы также можете найти демонстрационный проект на `Github <https://github.com/authoress/sphinx-intl-demo>`_ или `загрузить проект здесь <../_static/zen.zip>`_.
