Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/build-translated-documentation.po
Languages: fr, ru

source: Build translated documentation
fr: Construire la documentation traduite
ru: Сборка переведенной документации

source: `Sphinx documentation <https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_ recommends using two commands in sequence to build the translated documentation (in our example, in Russian)::
fr: `La documentation de Sphinx <https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_ recommande d'utiliser deux commandes en séquence pour construire la documentation traduite (dans notre exemple, en russe): :
ru: `Документация Sphinx <https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_ рекомендует последовательно использовать две команды для сборки переведенной документации (в нашем примере на русском языке)::

source: The first command sets the language of the documentation, and the second runs the build.
fr: La première commande définit la langue de la documentation, et la seconde exécute la compilation.
ru: Первая команда устанавливает язык документации, а вторая запускает сборку.

source: The problem with this method is that Sphinx writes the output to the directory specified in the make.bat file, and this directory is the same for all languages.
fr: Le problème avec cette méthode est que Sphinx écrit la sortie dans le répertoire spécifié dans le fichier make.bat, et ce répertoire est le même pour toutes les langues.
ru: Проблема с этим методом заключается в том, что Sphinx записывает результат в папку, указанную в файле make.bat, и эта папка одинакова для всех языков.

source: Therefore, we will use another method, which implies more control over various build parameters. We will run `sphinx-build <https://www.sphinx-doc.org/en/master/man/sphinx-build.html>`_ directly and specify the language and the build directory in a single command.
fr: C'est pourquoi nous allons utiliser une autre méthode, qui implique plus de contrôle sur les différents paramètres de construction. Nous lancerons `sphinx-build <https://www.sphinx-doc.org/en/master/man/sphinx-build.html>`_ directement et spécifierons le langage et le répertoire de construction en une seule commande.
ru: Поэтому воспользуемся другим методом, предполагающим больший контроль над различными параметрами сборки. Мы запустим `sphinx-build <https://www.sphinx-doc.org/en/master/man/sphinx-build.html>`_ напрямую и укажем язык и папку сборки в одной команде.

source: Before building the new documentation, you can remove everything from the **_build/html** directory, as we don't need the previously generated files anymore.
fr: Avant de construire la nouvelle documentation, vous pouvez supprimer tout ce qui se trouve dans le répertoire **_build/html**, car nous n'avons plus besoin des fichiers générés précédemment.
ru: Перед сборкой новой документации вы можете удалить все из папки **_build/html**, так как ранее сгенерированные файлы нам больше не нужны.

source: To build the Russian documentation with sphinx-build, run the following command::
fr: Pour construire la documentation russe avec sphinx-build, exécutez la commande suivante: :
ru: Чтобы собрать русскоязычную документацию с помощью sphinx-build, выполните следующую команду::

source: This command tells Sphinx to build html documentation (``-b html``) in Russian (``-D language=ru``) and put the result in the **_build/html/ru/** directory (``. _build/html/ru/``). The command also specifies the directory for doctrees files (``-d _build/doctrees/ru/``), otherwise Sphinx writes the doctrees files to the same directory as html files.
fr: Cette commande demande à Sphinx de construire la documentation html (``-b html``) en russe (``-D language=ru``) et de placer le résultat dans le répertoire **_build/html/ru/** (``. _build/html/ru/``). La commande spécifie également le répertoire pour les fichiers doctrees (``-d _build/doctrees/ru/``), sinon Sphinx écrit les fichiers doctrees dans le même répertoire que les fichiers html.
ru: Эта команда указывает Sphinx собрать html-документацию (``-b html``) на русском языке (``-D language=ru``) и поместить результат в папку **_build/html/ru/** (``. _build/html/ru/``). Команда также указывает папку для файлов doctrees (``-d _build/doctrees/ru/``), иначе Sphinx записывает файлы doctrees в ту же папку, что и html файлы.

source: To build the Portuguese documentation to **_build/html/pt_BR/**, run the following command::
fr: Pour compiler la documentation portugaise dans **_build/html/pt_BR/**, exécutez la commande suivante: :
ru: Чтобы собрать документацию на португальском языке в **_build/html/pt_BR/**, выполните следующую команду::

source: We also need to have English documentation in the **_build/html/en/** directory::
fr: Nous avons également besoin d'une documentation en anglais dans le répertoire **_build/html/en/**: :
ru: Также нам нужна англоязычная документация в папке **_build/html/en/**::

source: Placing localized documentation in separate directories as described above will help us further :ref:`develop a language switcher <switcher>`.
fr: Placer la documentation localisée dans des répertoires séparés comme décrit ci-dessus nous aidera à :ref:`développer un sélecteur de langue <switcher>`.
ru: Размещение локализованной документации в отдельных папках, как описано выше, поможет нам в дальнейшем :ref:`разработать переключатель языка <switcher>`.

source: If you now look into the **locale/ru/LC_MESSAGES** and **locale/pt_BR/LC_MESSAGES** directories, you can see that index.mo and easter-egg.mo files have appeared. Sphinx generates these binaries from .po files and then uses .mo files to build the output. You don't need to do anything with the .mo files, just ignore them.
fr: Si vous regardez maintenant dans les répertoires **locale/ru/LC_MESSAGES** et **locale/pt_BR/LC_MESSAGES**, vous pouvez voir que les fichiers index.mo et easter-egg.mo sont apparus. Sphinx génère ces binaires à partir des fichiers .po et utilise ensuite les fichiers .mo pour construire la sortie. Vous n'avez rien à faire avec les fichiers .mo, ignorez-les simplement.
ru: Если теперь заглянуть в папки **locale/ru/LC_MESSAGES** и **locale/pt_BR/LC_MESSAGES**, то можно увидеть, что там появились файлы index.mo и easter-egg.mo. Sphinx генерирует эти двоичные файлы из файлов .po, а затем использует файлы .mo для сборки. Вам не нужно ничего делать с файлами .mo, просто игнорируйте их.
