Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/create-demo-project.po
Languages: fr

source: Create demo project
fr: Créer un projet de démonstration

source: Our demo project will contain information `about The Zen of Python <https://www.python.org/dev/peps/pep-0020/>`_.
fr: Notre projet de démonstration contiendra des informations `sur le Zen of Python <https://www.python.org/dev/peps/pep-0020/>`_.

source: To create a demo project:
fr: Pour créer un projet de démonstration :

source: Create a directory for the demo project::
fr: Créer un répertoire pour le projet de démonstration ::

source: Go to the demo directory::
fr: Allez dans le répertoire démo ::

source: Create a new sphinx project with sphinx-quickstart::
fr: Créer un nouveau projet sphinx avec sphinx-quickstart ::

source: This command runs the Sphinx quickstart utility that asks you some questions about your project settings. Specify the settings as follows:
fr: Cette commande lance l'utilitaire de démarrage rapide de Sphinx qui vous pose quelques questions sur les paramètres de votre projet. Spécifiez les paramètres comme suit :

source: You can specify your own settings, but be sure to set the project language to English (en).
fr: Vous pouvez définir vos propres paramètres, mais veillez à ce que la langue du projet soit l'anglais (en).

source: After you answer all questions, the quickstart utility creates the project::
fr: Après avoir répondu à toutes les questions, l'utilitaire de démarrage rapide crée le projet ::

source: If you are familiar with Sphinx, you already know about index.rst, conf.py and other default project files.
fr: Si vous êtes familier avec Sphinx, vous connaissez déjà index.rst, conf.py et d'autres fichiers de projet par défaut.

source: Add content
fr: Ajouter du contenu

source: Open index.rst in any text editor and replace its content with the following:
fr: Ouvrez le fichier index.rst dans un éditeur de texte et remplacez son contenu par ce qui suit:

source: We added easter-egg.rst to the toctree, which means that we should create this file in the project directory. After you created the file (it should be encoded in UTF-8), put this text in it:
fr: Nous avons ajouté easter-egg.rst au toctree, ce qui signifie que nous devons créer ce fichier dans le répertoire du projet. Après avoir créé le fichier (il doit être encodé en UTF-8), mettez-y ce texte:

source: You can download `an archive that contains both files <../_static/rst-initial.zip>`_.
fr: Vous pouvez télécharger `une archive qui contient les deux fichiers <../_static/rst-initial.zip>`_.

source: Add images
fr: Ajouter des images

source: To add images to the demo project:
fr: Pour ajouter des images au projet de démonstration:

source: Download `an archive containing two images <../_static/egg-logo.zip>`_: logo.png (demo project logo) and egg.png (image of an egg).
fr: Téléchargez `une archive contenant deux images <../_static/egg-logo.zip>`_ : logo.png (logo du projet de démonstration) et egg.png (image d'un oeuf).

source: Unzip the archive and place both files in the **_static** directory of the demo project.
fr: Décompressez l'archive et placez les deux fichiers dans le répertoire **_static** du projet de démonstration.

source: Open conf.py, find the **Options for HTML output** section. Add html_theme_options containing logo.png after html_theme, like this:
fr: Ouvrez conf.py, trouvez la section **Options pour la sortie HTML**. Ajoutez html_theme_options contenant logo.png après html_theme, comme ceci :

source: Add egg.png to easter-egg.rst, like this:
fr: Ajoutez egg.png à easter-egg.rst, comme ceci :

source: You can `download conf.py and easter-egg.rst <../_static/conf-easter-egg.zip>`_ that already contain both additions.
fr: Vous pouvez `télécharger conf.py et easter-egg.rst <../_static/conf-easter-egg.zip>`_ qui contiennent déjà les deux ajouts.

source: Note that if you specified your own settings when creating the project, they will be overwritten by the settings from the downloaded conf.py.
fr: Notez que si vous avez spécifié vos propres paramètres lors de la création du projet, ils seront remplacés par les paramètres du fichier conf.py téléchargé.

source: Generate html
fr: Générer du html

source: Generate an html output to make sure everything works as expected::
fr: Générer une sortie html pour s'assurer que tout fonctionne comme prévu::

source: If the build is successful, the **_build/html** directory contains the html output::
fr: Si la compilation est réussie, le répertoire **_build/html** contient la sortie html::

source: If you open index.html in a browser, you should see the demo project:
fr: Si vous ouvrez index.html dans un navigateur, vous devriez voir le projet de démonstration :

source: The Zen of Python
fr: Le zen de Python
