Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/generate-files-for-translation.po
Languages: fr, ru

source: Generate files for translation
fr: Générer des fichiers pour la traduction
ru: Создание файлов для перевода

source: Generating files for translation is a two step procedure:
fr: La génération de fichiers pour la traduction est une procédure en deux étapes :
ru: Создание файлов для перевода представляет собой двухэтапную процедуру:

source: Generating .pot files, which contain the source strings and empty strings for further translation. Those empty strings in the .pot files are never filled with translation though. Instead, each .pot file is used as a template for as many language specific .po files as you need.
fr: Générer des fichiers .pot, qui contiennent les chaînes sources et des chaînes vides pour une traduction ultérieure. Ces chaînes vides dans les fichiers .pot ne sont jamais traduites. Au lieu de cela, chaque fichier .pot est utilisé comme modèle pour autant de fichiers .po spécifiques à une langue que vous souhaitez.
ru: Создание файлов .pot, содержащих исходные строки и пустые строки для дальнейшего перевода. Однако эти пустые строки в файлах .pot никогда не заполняются переводом. Вместо этого каждый файл .pot используется в качестве шаблона для необходимого количества файлов .po для конкретного языка.

source: Generating a set of .po files for every language. In our example, we will generate index.po and easter-egg.po for Russian and Portuguese.
fr: Générer un ensemble de fichiers .po pour chaque langue. Dans notre exemple, nous allons générer index.po et easter-egg.po pour le russe et le portugais.
ru: Создание набора файлов .po для каждого языка. В нашем примере мы создадим index.po и easter-egg.po для русского и португальского языков.

source: Generating .pot and .po files
fr: Générer des fichiers .pot et .po
ru: Создание файлов .pot и .po

source: Generate files for translation:
fr: Générer des fichiers pour la traduction :
ru: Сгенерируйте файлы для перевода:

source: Generate .pot files::
fr: Générer des fichiers .pot: :
ru: Сгенерируйте файлы .pot::

source: The index.pot and easter-egg.pot files should appear in the **_build/gettext** directory.
fr: Les fichiers index.pot et easter-egg.pot doivent apparaître dans le répertoire **_build/gettext**.
ru: В папке **_build/gettext** должны появиться файлы index.pot и easter-egg.pot.

source: Generate .po files::
fr: Générer des fichiers .po ::
ru: Сгенерируйте файлы .po::

source: Demo project directory should now contain the **locale** directory, whose name we specified earlier in conf.py. Inside the **locale** directory there are two directories: **ru** for Russian and **pt_BR** for Portuguese. Each of these two directories contains the **LC\_MESSAGES** directory with index.po and easter-egg.po files inside::
fr: Le répertoire du projet Demo doit maintenant contenir le répertoire **locale**, dont le nom a été spécifié plus tôt dans conf.py. Le répertoire **locale** contient deux répertoires : **ru** pour le russe et **pt_BR** pour le portugais. Chacun de ces deux répertoires contient le répertoire **LC\MESSAGES** avec les fichiers index.po et easter-egg.po à l'intérieur : :

source: Demo project directory should now contain the **locale** directory, whose name we specified earlier in conf.py. Inside the **locale** directory there are two directories: **ru** for Russian and **pt_br** for Portuguese. Each of these two directories contains the **LC\_MESSAGES** directory with index.po and easter-egg.po files inside::
ru: Каталог демо-проекта теперь должен содержать каталог **locale**, имя которого мы указали ранее в conf.py. Внутри каталога **locale** есть два каталога: **ru** для русского языка и **pt_br** для португальского языка. Каждый из этих двух каталогов содержит каталог **LC\_MESSAGES** с файлами index.po и easter-egg.po внутри::
