Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: fr, ru

source: Localizing docs in Sphinx
fr: Localisation des documents dans Sphinx
ru: Локализация документации в Sphinx

source: *Step by step guide*
fr: *Guide étape par étape*
ru: *Пошаговое руководство*

source: This guide demonstrates how to use the Sphinx functionality to localize your documentation created in Sphinx. The main goal of the guide is to show how to use **sphinx-intl** to translate the documentation. But there is more to it. With this guide, you can do the following:
fr: Ce guide montre comment utiliser les fonctionnalités de Sphinx pour localiser votre documentation créée dans Sphinx. L'objectif principal du guide est de montrer comment utiliser **sphinx-intl** pour traduire la documentation. Mais ce n'est pas tout. Avec ce guide, vous pouvez faire ce qui suit :
ru: В этом руководстве показано, как использовать возможности Sphinx для локализации документации, созданной в Sphinx. Основная цель руководства — показать, как использовать **sphinx-intl** для перевода документации. Но это еще не все. С помощью этого руководства вы можете сделать следующее:

source: Create a new Sphinx project and configure it to translate with sphinx-intl.
fr: Créez un nouveau projet Sphinx et configurez-le pour traduire avec sphinx-intl.
ru: Создать новый проект в Sphinx и настроить его для перевода с помощью sphinx-intl.

source: Translate the project manually or with Transifex.
fr: Traduire le projet manuellement ou avec Transifex.

source: Use language specific images.
fr: Utiliser des images spécifiques à la langue.
ru: Использовать собственные изображения для каждого языка.

source: Add conditional text that is published only in the languages you specify.
fr: Ajouter un texte conditionnel qui ne sera publié que dans les langues spécifiées.
ru: Добавить условный текст, который публикуется только на указанных вами языках.

source: Build the translated documentation with sphinx-build.
fr: Construire la documentation traduite avec sphinx-build.

source: Develop a simple language switcher and a start page for the html output.
fr: Développer un simple sélecteur de langue et une page d'accueil pour la sortie html.

source: Publish your documentation on GitHub Pages.
fr: Publiez votre documentation sur GitHub Pages.

source: Step by step, we will create and translate a demo project from English into two languages: Russian and Portuguese (Brazilian). Hopefully after that you will be able to apply this knowledge to your documentation.
fr: Étape par étape, nous créerons et traduirons un projet de démonstration de l'anglais vers deux langues : le russe et le portugais (brésilien). Nous espérons qu'après cela, vous serez en mesure d'appliquer ces connaissances à votre documentation.
ru: Шаг за шагом мы создадим и переведем демонстрационный проект с английского на два языка: русский и португальский (бразильский). Надеюсь, после этого вы сможете применить эти знания к своей документации.

source: I'm assuming you are already familiar with Sphinx. Otherwise, start either with the `Sphinx documentation <https://www.sphinx-doc.org/en/master/usage/quickstart.html>`__ or `Readthedocs <https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html>`__.
fr: Je suppose que vous êtes déjà familiarisé avec Sphinx. Sinon, commencez par consulter la `Documentation Sphinx <https://www.sphinx-doc.org/en/master/usage/quickstart.html>`__ ou `Readthedocs <https://docs.readthedocs.io/en/stable/intro/getting-started-with-sphinx.html>`__.
ru: Я предполагаю, что вы уже знакомы со Sphinx. В противном случае начните либо с `документации Sphinx <https://www.sphinx-doc.org/en/master/usage/quickstart.html>`__, либо с `Readthedocs <https://docs.readthedocs.io/en/ stable/intro/getting-started-with-sphinx.html>`__.

source: Translate the project and build the translated documentation.
ru: Перевести проект и собрать переведенную документацию.

source: Develop a simple language switcher for the html output.
ru: Разработать простой переключатель языка для справки в формате html.
