Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/publish-on-github-pages.po
Languages: fr, ru

source: Publish on GitHub Pages
fr: Publier sur GitHub Pages
ru: Публикация на GitHub Pages

source: As `GitHub documentation <https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages>`_ says, "GitHub Pages is a static site hosting service that takes files straight from a repository on GitHub, optionally runs the files through a build process, and publishes a website".
fr: Comme le dit `la documentation de GitHub <https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages>`_, "GitHub Pages est un service d'hébergement de site statique qui prend des fichiers directement dans un dépôt sur GitHub, exécute éventuellement les fichiers à travers un processus de construction, et publie un site web".
ru: Как говорится в `документации GitHub <https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages>`_, "GitHub Pages — это служба размещения статических сайтов, которая принимает файлы HTML, CSS и JavaScript прямо из репозитория в GitHub, при необходимости выполняет файлы с помощью процесса сборки и публикует веб-сайт".

source: Before you publish your documentation on GitHub Pages, make sure your documentation files are in the **zen/_build/html** directory of your repository, like this:
fr: Avant de publier votre documentation sur GitHub Pages, assurez-vous que vos fichiers de documentation se trouvent dans le répertoire **zen/_build/html** de votre dépôt, comme ceci :
ru: Прежде чем публиковать свою документацию на GitHub Pages, убедитесь, что ваши файлы документации находятся в каталоге **zen/_build/html** вашего репозитория, например:

source: If you created your repository from the demo repository template, all the required files are already in the zen/_build/html directory.
fr: Si vous avez créé votre référentiel à partir du modèle de référentiel démo, tous les fichiers nécessaires se trouvent déjà dans le répertoire zen/_build/html.
ru: Если вы создали свой репозиторий на основе шаблона демонстрационного репозитория, все необходимые файлы уже находятся в каталоге zen/_build/html.

source: To publish files from this directory on GitHub Pages:
fr: Pour publier les fichiers de ce répertoire sur les pages GitHub :
ru: Чтобы опубликовать файлы из этого каталога на GitHub Pages:

source: Open your repository settings.
fr: Ouvrez les paramètres de votre référentiel.
ru: Откройте настройки вашего репозитория.

source: Select **Pages**.
fr: Sélectionnez **Pages**.
ru: Выберите **Pages**.

source: In the **Build and deployment** section, under **Source**, select **GitHub Actions**.
fr: Dans la section **Build and deployment**, sous **Source**, sélectionnez **GitHub Actions**.
ru: В разделе **Build and deployment** в разделе **Source** выберите **GitHub Actions**.

source: In **Static HTML**, click **Configure**.
fr: Dans **Static HTML**, cliquez sur **Configure**.
ru: В **Static HTML** нажмите **Configure**.

source: GitHub pages settings
fr: Paramètres des pages GitHub
ru: Настройки GitHub Pages

source: GitHub creates a .github/workflows/static.yml file for you.
fr: GitHub crée un fichier .github/workflows/static.yml pour vous.
ru: GitHub создает для вас файл .github/workflows/static.yml.

source: In static.yml file, find the **path** element, it should look like this::
fr: Dans le fichier static.yml, trouvez l'élément **path**, il devrait ressembler à ceci: :
ru: В файле static.yml найдите элемент **path**, он должен выглядеть следующим образом::

source: Change the path as follows::
fr: Modifiez le chemin d'accès comme suit: :
ru: Измените его следующим образом::

source: Click **Start commit**, and then **Commit new file**.
fr: Cliquez sur **Start commit**, puis sur **Commit new file**.
ru: Нажмите **Start commit**, а затем **Commit new file**.

source: Commiting static.yml
fr: Validation du fichier static.yml
ru: Коммит static.yml

source: Once static.yml is committed, GitHub immediately starts publishing your documentation site. The publishing process may take some time, and when it is finished, you can open your documentation by clicking **Visit site** on **Settings -> Pages**:
fr: Une fois que le fichier static.yml est validé, GitHub commence immédiatement à publier votre site de documentation. Le processus de publication peut prendre un certain temps, et lorsqu'il est terminé, vous pouvez ouvrir votre documentation en cliquant sur **Visit site** dans **Settings -> Pages** :
ru: Как только static.yml будет зафиксирован, GitHub немедленно начнет публиковать ваш сайт документации. Процесс публикации может занять некоторое время, и когда он будет завершен, вы можете открыть свою документацию, нажав **Visit site** в **Settings -> Pages**:

source: Visit site
fr: Visiter le site
