Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/translate-text-*-files.po
Languages: fr, ru

source: Translate text in .po files
fr: Traduire le texte dans les fichiers .po
ru: Перевод текста в файлах .po

source: Localization specialists use professional tools to translate real projects: `CAT <https://en.wikipedia.org/wiki/Computer-assisted_translation>`_ tools, `TMS <https://en.wikipedia.org/wiki/Translation_management_system>`_ systems etc. To better understand the .po files structure, we will start with manual translation. After that, we will get acquainted with Transifex, one of the popular translation management systems.
fr: Les spécialistes de la localisation utilisent des outils professionnels pour traduire des projets réels : `CAT <https://en.wikipedia.org/wiki/Computer-assisted_translation>`_ outils, `TMS <https://en.wikipedia.org/wiki/Translation_management_system>`_ systèmes, etc. Pour mieux comprendre la structure des fichiers .po, nous commencerons par une traduction manuelle. Ensuite, nous nous familiariserons avec Transifex, l'un des systèmes de gestion de traduction les plus populaires.
ru: Специалисты по локализации используют профессиональные инструменты для перевода реальных проектов: `CAT <https://en.wikipedia.org/wiki/Computer-assisted_translation>`_, `TMS <https://en.wikipedia.org/wiki/Translation_management_system>`_ системы и т.д. Чтобы лучше понять структуру файлов .po, мы начнем с ручного перевода. После этого мы познакомимся с Transifex, одной из популярных систем управления переводами.

source: Before you start, download `the translation lists <../_static/translation-lists.zip>`_ to get Russian and Portuguese translations of all texts.
fr: Avant de commencer, téléchargez `les listes de traduction <.../_static/translation-lists.zip>`_ pour obtenir les traductions en russe et en portugais de tous les textes.
ru: Прежде чем начать, загрузите `списки переводов <_static/translation-lists.zip>`_, чтобы получить переводы всех текстов на русский и португальский языки.

source: You can :ref:`build the translated documentation <build>` at any time, even if the translation is not finished. This helps you see the intermediate result and understand :ref:`how gettext works <gettext>`.
fr: Vous pouvez :ref:`construire la documentation traduite <build>` à tout moment, même si la traduction n'est pas terminée. Cela vous permet de voir le résultat intermédiaire et de comprendre :ref:`comment fonctionne gettext <gettext>`.
ru: Вы можете :ref:`собрать переведенную документацию <build>` в любое время, даже если перевод еще не закончен. Это поможет вам увидеть промежуточный результат и понять, :ref:`как работает gettext <gettext>`.

source: Manual translation
fr: Traduction manuelle
ru: Ручной перевод

source: Let’s start from translating our texts into Russian:
fr: Commençons par traduire nos textes en russe :
ru: Сначала переведем наши тексты на русский язык:

source: Open index.po in **locale/ru/LC_MESSAGES** and find these lines::
fr: Ouvrez index.po dans **locale/ru/LC_MESSAGES** et trouvez ces lignes: :
ru: Откройте index.po в **locale/ru/LC_MESSAGES** и найдите такие строки:

source: The first line points to the source file and the exact line in it.
fr: La première ligne pointe vers le fichier source et la ligne exacte qu'il contient.
ru: Первая строка указывает на исходный файл и точную строку в нем.

source: The second, ``msgid``, is for the source text itself; it also serves as a string ID.
fr: Le second, ``msgid``, est pour le texte source lui-même ; il sert également d'identifiant pour la chaîne.
ru: Второй, ``msgid``, предназначен для самого исходного текста; он также служит идентификатором строки.

source: The third, ``msgstr``, should contain the translation of the string from msgid.
fr: La troisième, ``msgstr``, doit contenir la traduction de la chaîne de msgid.
ru: Третий, ``msgstr``, должен содержать перевод строки из msgid.

source: Put the translation to msgstr like this::
fr: Mettez la traduction de msgstr comme ceci: :
ru: Поместите перевод в msgstr следующим образом::

source: Do the same for other strings in index.po and easter-egg.po.
fr: Faites de même pour les autres chaînes de caractères dans index.po et easter-egg.po.
ru: Сделайте то же самое для других строк в index.po и easter-egg.po.

source: Note the escape characters in this string::
fr: Notez les caractères d'échappement dans cette chaîne: :
ru: Обратите внимание на escape-символы в этой строке::

source: Be careful to keep all such characters as well as the reST notation.
fr: Veillez à conserver tous ces caractères ainsi que la notation reST.
ru: Будьте осторожны, чтобы сохранить все такие символы, а также нотацию reST.

source: Here is the example of the above string in Russian::
fr: Voici l'exemple de la chaîne ci-dessus en russe: :
ru: Вот пример приведенной выше строки на русском языке::

source: Once you're done with Russian, repeat the process with index.po in **locale/pt_BR/LC_MESSAGES** to translate it into Portuguese. For now, do not translate easter-egg.po, we will use Transifex to translate this file.
fr: Une fois que vous avez terminé avec le russe, répétez le processus avec index.po dans **locale/pt_BR/LC_MESSAGES** pour le traduire en portugais. Pour l'instant, ne traduisez pas easter-egg.po, nous utiliserons Transifex pour traduire ce fichier.

source: You can download `an archive that contains .po files <../_static/po-translated.zip>`_ already translated into Russian and Portuguese (except for the Portuguese version of easter-egg.po).
fr: Vous pouvez télécharger `une archive qui contient des fichiers .po <.../_static/po-translated.zip>`_ déjà traduits en russe et en portugais (à l'exception de la version portugaise de easter-egg.po).
ru: Вы можете скачать `архив, содержащий .po-файлы <_static/po-translated.zip>`_, уже переведенные на русский и португальский языки (кроме португальской версии easter-egg.po).

source: Using Transifex
fr: Utilisation de Transifex
ru: Использование Transifex

source: Sphinx documentation and Readthedocs describe Transifex integration using the Transifex Client. We will use another option: integration with GitHub via Transifex UI. For this, you will need your own copy of the demo repository on GitHub. The easiest way is to use the `sphinx-intl-demo repository <https://github.com/authoress/sphinx-intl-demo>`_ as a template. Note that easter-egg.po in locale/pt_br/LC_MESSAGES is intentionally left untranslated.
fr: La documentation de Sphinx et les Readthedocs décrivent l'intégration de Transifex en utilisant le client Transifex. Nous allons utiliser une autre option : l'intégration avec GitHub via l'interface Transifex. Pour cela, vous aurez besoin de votre propre copie du dépôt de démonstration sur GitHub. Le plus simple est d'utiliser le dépôt `sphinx-intl-demo <https://github.com/authoress/sphinx-intl-demo>`_ comme modèle. Notez que easter-egg.po dans locale/pt_br/LC_MESSAGES est intentionnellement laissé non traduit.
ru: Документация Sphinx и Readthedocs описывают интеграцию Transifex с использованием Transifex Client. Мы будем использовать другой вариант: интеграцию с GitHub через Transifex UI. Для этого вам понадобится ваша собственная копия демо-репозитория на GitHub. Самый простой способ - использовать `репозиторий sphinx-intl-demo <https://github.com/authoress/sphinx-intl-demo>`_ в качестве шаблона. Обратите внимание, что easter-egg.po в locale/pt_br/LC_MESSAGES намеренно оставлен непереведенным.

source: Use this template -> Create a new repository
fr: Utiliser ce modèle -> Créer un nouveau dépôt

source: Creating a new repository from a template
fr: Création d'un nouveau référentiel à partir d'un modèle
ru: Создание нового репозитория из шаблона

source: Now you are ready to integrate Transifex into your translation process.
fr: Vous êtes maintenant prêt à intégrer Transifex dans votre processus de traduction.
ru: Теперь вы готовы интегрировать Transifex в свой процесс перевода.

source: Create an account and organization
fr: Créer un compte et une organisation
ru: Создайте учетную запись и организацию

source: When `creating an account <https://www.transifex.com/signup/open-source/>`_, Transifex invites you to create an Open Source organization or join an existing organization. For our demo project, we’ll need a new organization.
fr: Lors de la `création d'un compte <https://www.transifex.com/signup/open-source/>`_, Transifex vous invite à créer une organisation Open Source ou à rejoindre une organisation existante. Pour notre projet de démonstration, nous aurons besoin d'une nouvelle organisation.
ru: При `создании учетной записи <https://www.transifex.com/signup/open-source />`_ Transifex приглашает вас создать организацию с открытым исходным кодом или присоединиться к существующей организации. Для нашего демонстрационного проекта нам понадобится новая организация.

source: It doesn’t matter if you actually work for an organization or own one. On Transifex, organization is just a way to organize your projects.
fr: Peu importe que vous travailliez pour une organisation ou que vous en possédiez une. Sur Transifex, l'organisation n'est qu'un moyen d'organiser vos projets.
ru: Неважно, работаете ли вы в организации на самом деле или являетесь владельцем таковой. На Transifex организация — это просто способ упорядочить ваши проекты.

source: In short, a user can be an administrator of an organization that owns some projects, and each project includes resources. `Learn more about Transifex organizations, projects and resources <https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources>`_.
fr: En bref, un utilisateur peut être administrateur d'une organisation qui possède des projets, et chaque projet comprend des ressources. Pour en savoir plus sur les organisations, les projets et les ressources de Transifex, cliquez ici.
ru: Вкратце, пользователь может быть администратором организации, которой принадлежит несколько проектов, и каждый проект включает в себя ресурсы. `Узнайте больше об организациях, проектах и ресурсах Transifex <https://help.transifex.com/en/articles/6656105-introduction-to-projects-and-resources>`_.

source: Create a project
fr: Créer un projet
ru: Создайте проект

source: When you are done with the account and organization, Transifex invites you to create a project. For our demo project, specify the project settings as follows:
fr: Lorsque vous avez terminé la création du compte et de l'organisation, Transifex vous invite à créer un projet. Pour notre projet de démonstration, spécifiez les paramètres du projet comme suit :
ru: Когда вы закончите с учетной записью и организацией, Transifex предложит вам создать проект. Для нашего демонстрационного проекта укажите настройки следующим образом:

source: Project name: sphinx-intl-demo (choose another name if you want).
fr: Nom du projet : sphinx-intl-demo (choisissez un autre nom si vous le souhaitez).
ru: Название проекта: sphinx-intl-demo (выберите другое название, если хотите).

source: URL to open source license: specify the path to the license file in your GitHub repository. It should be something like this: ``https://github.com/<your_account>/sphinx-intl-demo/blob/main/LICENSE``
fr: URL de la licence open source : indiquez le chemin d'accès au fichier de licence dans votre dépôt GitHub. Il devrait ressembler à ceci : ``https://github.com/<votre_compte>/sphinx-intl-demo/blob/main/LICENSE``.
ru: URL-адрес лицензии с открытым исходным кодом: укажите путь к файлу лицензии в вашем репозитории GitHub. Это должно быть что-то вроде этого: ``https://github.com/<your_account>/sphinx-intl-demo/blob/main/LICENSE``

source: Project type: File based.
fr: Type de projet : Dossier basé.
ru: Тип проекта: File based.

source: Source language: English.
fr: Langue source : Anglais.
ru: Язык оригинала: English.

source: Target languages: Russian, Portuguese (Brazil).
fr: Langues cibles : Russe, Portugais (Brésil).
ru: Целевые языки: Russian, Portuguese (Brazil).

source: transifex project settings
fr: Paramètres du projet transifex
ru: настройки проекта в Transifex

source: Adding a new project
fr: Ajouter un nouveau projet
ru: Добавление нового проекта

source: Click **Create project** to finish adding a project.
fr: Cliquez sur **Créer un projet** pour terminer l'ajout d'un projet.
ru: Нажмите **Create project**, чтобы завершить добавление проекта.

source: Integrate Transifex and GitHub
fr: Intégrer Transifex et GitHub
ru: Интеграция Transifex и GitHub

source: Integrate your Transifex and GitHub accounts as described `in the Transifex documentation <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_:
fr: Intégrez vos comptes Transifex et GitHub comme décrit `dans la documentation Transifex <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_ :

source: Go to your organization settings -> Integrations.
fr: Allez dans les paramètres de votre organisation -> Intégrations.
ru: Перейдите в раздел интеграций вашей организации (Organization settings -> Integrations).

source: In the GitHub integration box, click **Authorize** and then **Install the Transifex app**.
fr: Dans la boîte d'intégration GitHub, cliquez sur **Autoriser** puis **Installer l'application Transifex**.
ru: В блоке интеграции с GitHub нажмите **Authorize**, а затем **Install the Transifex app**.

source: Manage Integrations page
fr: Page Gérer les intégrations
ru: Страница управления интеграциями

source: Authorizing GitHub
fr: Autoriser GitHub
ru: Авторизация GitHub

source: From the **Select repositories** drop-down menu, select your demo repository, and then click **Install**.
fr: Dans le menu déroulant **Select repositories**, sélectionnez votre dépôt de démonstration, puis cliquez sur **Install**.
ru: В раскрывающемся меню **Select repositories** выберите свой демонстрационный репозиторий, а затем нажмите **Install**.

source: Confirm your GitHub password. The Transifex Integration is now installed on your GitHub account.
fr: Confirmez votre mot de passe GitHub. L'intégration Transifex est maintenant installée sur votre compte GitHub.
ru: Подтвердите свой пароль на GitHub. Интеграция Transifex теперь установлена в вашей учетной записи GitHub.

source: Get back to Transifex and go to your organization settings -> Integrations.
fr: Retournez dans Transifex et allez dans les paramètres de votre organisation -> Intégrations.
ru: Вернитесь в Transifex и перейдите в раздел интеграций вашей организации (Organization settings -> Integrations).

source: In the Github integration box, click **Authorize** and then **authorize Transifex**.
fr: Dans la boîte d'intégration Github, cliquez sur **Autoriser** puis **autoriser Transifex**.
ru: В окне интеграции с Github нажмите **Authorize**, а затем **authorize Transifex**.

source: If Transifex requires some permissions, click **Authorize Transifex Integration**.
fr: Si Transifex requiert certaines autorisations, cliquez sur **Autoriser l'intégration de Transifex**.
ru: Если Transifex требует некоторых разрешений, нажмите **Authorize Transifex Integration**.

source: Finish integration by clicking your GitHub account name in the list of available installations.
fr: Terminez l'intégration en cliquant sur le nom de votre compte GitHub dans la liste des installations disponibles.
ru: Завершите интеграцию, щелкнув имя вашей учетной записи GitHub в списке доступных установок.

source: GitHub Authorization
fr: Autorisation GitHub
ru: Авторизация на GitHub

source: Final step of integration
fr: Dernière étape de l'intégration
ru: Заключительный этап интеграции

source: Your demo repository should now be authorized on Transifex.
fr: Votre dépôt de démonstration devrait maintenant être autorisé sur Transifex.
ru: Теперь ваш демонстрационный репозиторий должен быть авторизован на Transifex.

source: Link your Transifex project with GitHub
fr: Liez votre projet Transifex à GitHub
ru: Свяжите свой проект Transifex с GitHub

source: Link your project with your GitHub demo repository as described in the `Transifex documentation <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui#h_de29ef5cec>`_:
fr: Liez votre projet avec votre dépôt de démonstration GitHub comme décrit dans la documentation `Transifex <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui#h_de29ef5cec>`_ :
ru: Свяжите свой проект с демонстрационным репозиторием GitHub, как описано в `документации Transifex <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui#h_de29ef5cec>`_:

source: Go to your project settings -> Integrations.
fr: Allez dans les paramètres de votre projet -> Intégrations.
ru: Перейдите в настройки вашего проекта, раздел Integrations.

source: In the **GitHub** box, click **Link Repository**.
fr: Dans la boîte **GitHub**, cliquez sur **Lier le dépôt**.
ru: В блоке **GitHub** нажмите **Link Repository**.

source: Project Integrations
fr: Intégrations de projets

source: Linking repository
fr: Référentiel de liaison
ru: Связывание репозитория

source: On the **Select repo** tab, specify **main** as the branch name, then click **Validate**.
fr: Dans l'onglet **Select repo**, indiquez **main** comme nom de branche, puis cliquez sur **Validate**.
ru: На вкладке **Select repo** укажите ветку **main**, затем нажмите **Validate**.

source: Select Repo
fr: Sélectionner Repo

source: Validating branch
fr: Validation de la branche
ru: Проверка ветки

source: Click **Next**.
fr: Cliquez sur **Suivant**.
ru: Нажмите **Next**.

source: On the **Select Files** tab, you need to specify the name of the YML configuration file that defines how the integration works. If you have created your repository from the demo template, transifex.yml is already there. Otherwise, create transifex.yml in the root of your repository and put the following content in it::
fr: Dans l'onglet **Select Files**, vous devez spécifier le nom du fichier de configuration YML qui définit le fonctionnement de l'intégration. Si vous avez créé votre référentiel à partir du modèle de démonstration, transifex.yml s'y trouve déjà. Sinon, créez transifex.yml à la racine de votre référentiel et mettez-y le contenu suivant: :
ru: На вкладке **Select Files** вам необходимо указать имя файла конфигурации YML, который определяет, как работает интеграция. Если вы создали свой репозиторий на основе демо-шаблона, transifex.yml уже есть в вашем репозитории. В противном случае создайте transifex.yml в корне вашего репозитория и поместите в него следующее содержимое::

source: Here, we tell Transifex to take source .pot files from zen/_build/gettext and to put translated .po files to zen/locale/<lang>/LC_MESSAGES, where <lang> is a language code (in our project, it’s either ru or pt_BR).
fr: Ici, nous demandons à Transifex de prendre les fichiers source .pot dans zen/_build/gettext et de placer les fichiers .po traduits dans zen/locale/<lang>/LC_MESSAGES, où <lang> est un code de langue (dans notre projet, c'est soit ru, soit pt_BR).
ru: Здесь мы говорим Transifex взять исходные файлы .pot из zen/_build/gettext и поместить переведенные файлы .po в zen/locale/<lang>/LC_MESSAGES, где <lang> — это код языка (в нашем проекте это либо ru, либо pt_BR).

source: When the transifex.yml file is in the root of your repository, on the **Select Files** tab, click **Apply**.
fr: Lorsque le fichier transifex.yml se trouve à la racine de votre référentiel, dans l'onglet **Select Files**, cliquez sur **Apply**.
ru: Когда файл transifex.yml помещен в корень вашего репозитория, на вкладке **Select Files** нажмите **Apply**.

source: On the **Sync Content** tab, select **100% reviewed** and **Create a Pull Request**.
fr: Dans l'onglet **Sync Content**, sélectionnez **100% reviewed** et **Create a Pull Request**.
ru: На вкладке **Sync Content** выберите **100% reviewed** и **Create a Pull Request**.

source: Click **Save & Sync**.
fr: Cliquez sur **Save & Sync**.
ru: Нажмите **Save & Sync**.

source: Your Transifex project is now linked with your GitHub repository.
fr: Votre projet Transifex est maintenant lié à votre dépôt GitHub.
ru: Ваш проект Transifex теперь связан с вашим репозиторием GitHub.

source: In Project Integrations, you will find the status of synchronizing source files.
fr: Dans Project Integrations, vous trouverez l'état de la synchronisation des fichiers sources.
ru: В разделе Project Integrations вы найдете статус синхронизации исходных файлов.

source: GitHub repository linked
fr: Dépôt GitHub lié
ru: Связанный репозиторий GitHub

source: Translate files in Transifex Editor
fr: Traduire des fichiers dans l'éditeur Transifex
ru: Переведите файлы в редакторе Transifex

source: To translate easter-egg.po into Portuguese:
fr: Traduire easter-egg.po en portugais :
ru: Чтобы перевести easter-egg.po на португальский:

source: Go to Transifex Editor by clicking **Editor** at the top of the page.
fr: Accédez à Transifex Editor en cliquant sur **Editor** en haut de la page.
ru: Перейдите в редактор Transifex, нажав **Editor** в верхней части страницы.

source: From the target language drop-down menu, select **Portuguese (Brazil)**.
fr: Dans le menu déroulant de la langue cible, sélectionnez **Portugais (Brésil)**.
ru: В раскрывающемся меню целевого языка выберите **Portuguese (Brazil)**.

source: target language selector
fr: sélecteur de langue cible
ru: выбор целевого языка

source: Selecting target language
fr: Sélection de la langue cible
ru: Выбор целевого языка

source: In the **Resource Overview** list, click **zen...easter-egg.pot(main)**. Transifex Editor opens.
fr: Dans la liste **Resource Overview**, cliquez sur **zen...easter-egg.pot(main)**. L'éditeur Transifex s'ouvre.
ru: В списке **Resource Overview** нажмите **zen...easter-egg.pot(main)**. Откроется редактор Transifex.

source: In the strings list on the left, click **Easter Egg**. Put the translation for this string (*Ovo de Páscoa*) into the translation area on the right.
fr: Dans la liste des chaînes à gauche, cliquez sur **Easter Egg**. Placez la traduction de cette chaîne (*Ovo de Páscoa*) dans la zone de traduction à droite.
ru: В списке строк слева нажмите **Easter Egg**. Поместите перевод для этой строки (*Ovo de Páscoa*) в область перевода справа.

source: Strings to translate, translation area
fr: Chaînes à traduire, zone de traduction
ru: Строки для перевода, область перевода

source: Transifex Editor
fr: Éditeur Transifex
ru: Редактор Transifex

source: Click **Save Translation**.
fr: Cliquez sur **Enregistrer la traduction**.
ru: Нажмите **Save Translation**.

source: Repeat for two other strings.
fr: Répétez l'opération pour deux autres cordes.
ru: Повторите для двух других строк.

source: Select all the translated strings by clicking the grouping checkbox on the left. In the **Bulk actions** panel on the right, select **Reviewed** from the **Mark as** drop-down menu, and then click **Apply**.
fr: Sélectionnez toutes les chaînes traduites en cliquant sur la case à cocher de regroupement à gauche. Dans le panneau **Actions groupées** à droite, sélectionnez **Revu** dans le menu déroulant **Marquer comme**, puis cliquez sur **Appliquer**.
ru: Выберите все переведенные строки, установив флажок группировки слева. На панели **Bulk actions** справа выберите **Reviewed** из выпадающего меню **Mark as**, а затем нажмите **Apply**.

source: Bulk actions
fr: Actions en bloc

source: Applying **Reviewed** status to all strings
fr: Appliquer le statut **Revu** à toutes les chaînes de caractères
ru: Применение статуса **Reviewed** ко всем строкам

source: All the strings in easter-egg are now translated and reviewed.
fr: Toutes les chaînes de l'œuf de Pâques ont été traduites et révisées.
ru: Все строки в easter-egg теперь переведены и проверены.
