Repository: authoress/sphinx-intl-guide
Catalog: docs/locales/*/LC_MESSAGES/translate-text-*-files.po
Languages: fr, ru

source: `Learn more about Transifex Editor in the documentation <https://help.transifex.com/en/articles/6318216-translating-with-the-web-editor>`_.
fr: `Pour en savoir plus sur l'éditeur Transifex, consultez la documentation <https://help.transifex.com/en/articles/6318216-translating-with-the-web-editor>`_.
ru: `Узнайте больше о редакторе Transifex в документации <https://help.transifex.com/en/articles/6318216-translating-with-the-web-editor>`_.

source: Merge pull request on GitHub
fr: Fusionner la demande de pull sur GitHub
ru: Слияние запроса на вытягивание на GitHub

source: Once one of our resources is fully translated and reviewed, Transifex automatically sends it to GitHub by creating a pull request. You can find the information about it on the Project Integrations page.
fr: Une fois qu'une de nos ressources est entièrement traduite et révisée, Transifex l'envoie automatiquement à GitHub en créant une demande d'extraction. Vous pouvez trouver les informations à ce sujet sur la page Intégrations de projets.
ru: Как только один из наших ресурсов полностью переведен и проверен, Transifex автоматически отправляет его на GitHub, создавая запрос на вытягивание. Вы можете найти информацию об этом на странице Project Integrations.

source: To merge the pull request:
fr: Pour fusionner la pull request :
ru: Чтобы объединить запрос на вытягивание:

source: On GitHub, go to your demo repository Pull requests.
fr: Sur GitHub, allez dans votre dépôt de démonstration Pull requests.
ru: На GitHub перейдите в раздел Pull requests своего демо-репозитория.

source: Pull requests page on GitHub
fr: Page des demandes d'extraction sur GitHub
ru: Страница запросов на вытягивание на GitHub

source: Pull request from Transifex
fr: Demande d'extraction de Transifex
ru: Запрос на вытягивание от Transifex

source: Click the pull request name. The format of pull request names from Transifex is ``Transifex '<path to the source>' in '<language code>'``.
fr: Cliquez sur le nom de la demande d'extraction. Le format des noms de demandes d'extraction de Transifex est ``Transifex '<chemin vers la source>' en '<code langue>'``.
ru: Щелкните имя запроса на вытягивание. Формат имен запросов на вытягивание от Transifex следующий: ``Transifex '<путь к источнику>' in '<код языка>'``.

source: On the **Files changed** tab, check that all the translated strings are correct.
fr: Dans l'onglet **Fichiers modifiés**, vérifiez que toutes les chaînes traduites sont correctes.
ru: На вкладке **Files changed** проверьте правильность всех переведенных строк.

source: On the **Conversation** tab, click **Merge pull request**, then **Confirm merge**.
fr: Dans l'onglet **Conversation**, cliquez sur **Fusionner la demande de retrait**, puis **Confirmer la fusion**.
ru: На вкладке **Conversation** нажмите **Merge pull request**, затем **Confirm merge**.

source: After the pull request is merged, you can delete the branch.
fr: Une fois la demande de traction fusionnée, vous pouvez supprimer la branche.
ru: После того, как запрос на вытягивание будет объединен, вы можете удалить ветку.

source: Pull request successfully merged and closed
fr: La pull request a été fusionnée et clôturée avec succès
ru: Запрос на вытягивание успешно объединен и закрыт

source: Deleting branch
fr: Suppression d'une branche
ru: Удаление ветки

source: Now all the texts in .po files are translated.
fr: Tous les textes des fichiers .po sont maintenant traduits.
ru: Теперь все тексты в файлах .po переведены.

source: You can pull the newly translated .po file from GitHub (by using ``git pull``) to build your documentation locally.
fr: Vous pouvez extraire le fichier .po nouvellement traduit de GitHub (en utilisant ``git pull``) pour construire votre documentation localement.

source: Once you're done with Russian, repeat the process with index.po in **locale/pt_BR/LC_MESSAGES** to translate the project into Portuguese. For now, do not translate easter-egg.po into Portuguese, we will use Transifex to translate this file.
ru: Как только вы закончите с русским языком, повторите процесс с index.po в **locale/pt_BR/LC_MESSAGES**, чтобы перевести проект на португальский. Пока не переводите easter-egg.po на португальский, мы будем использовать Transifex для перевода этого файла.

source: Integrate your Transifex and GitHub accounts as described in the `Transifex documentation <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_:
ru: Интегрируйте свои учетные записи Transifex и GitHub, как описано в `Документации Transifex <https://help.transifex.com/en/articles/6265125-github-via-transifex-ui>`_:

source: You can pull the updated .po file from GitHub to build your documentation locally.
ru: Вы можете извлечь обновленный файл .po из GitHub, чтобы создать свою документацию локально.
